In [19]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv("fil.csv")

In [9]:
df

   Transaction_ID         Date       Time   Amount     Description
0               1   2024-06-01   10:15:00    50.00   Grocery Store
1               2   2024-06-02   15:30:00    20.50     Coffee Shop
2               3   2024-06-03   12:00:00    75.25      Restaurant
3               4   2024-06-04   09:45:00    15.75       Bookstore
4               5   2024-06-05   14:20:00    30.00     Gas Station

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction_ID  5 non-null      int64
 1    Date           5 non-null      object
 2    Time           5 non-null      object
 3    Amount         5 non-null      float64
 4    Description    5 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

In [12]:
df.describe()

       Transaction_ID     Amount
count        5.000000   5.000000
mean         3.000000  38.300000
std          1.581139  24.476647
min          1.000000  15.750000
25%          2.000000  20.500000
50%          3.000000  30.000000
75%          4.000000  50.000000
max          5.000000  75.250000

In [17]:
df.isnull().sum()

Transaction_ID    0
 Date             0
 Time             0
 Amount           0
 Description      0
dtype: int64

In [18]:
df.duplicated().sum()

0